#!/usr/bin/env python
#-*- coding: utf-8 -*-

text = """
       Машинне навчання (англ. machine learning) — це підгалузь інформатики[1]
       (зокрема, м'яких[en] та гранульованих обчислень[en]), яка еволюціювала з 
       дослідження розпізнавання образів та теорії обчислювального навчання[en] 
       в галузі штучного інтелекту.[1] 1959 року Артур Семюель визначив машинне 
       навчання як «Галузь досліджень, яка дає комп'ютерам здатність навчатися 
       без того, щоби їх явно програмували».[2] Машинне навчання досліджує 
       вивчення та побудову алгоритмів, які можуть навчатися з даних, і 
       виконувати передбачувальний аналіз на них.[3] Такі алгоритми діють 
       шляхом побудови моделі зі зразкового тренувального набору[en] вхідних 
       спостережень, щоби здійснювати керовані даними прогнози або ухвалювати 
       рішення, виражені як виходи,[4]:2 замість того, щоби суворо слідувати 
       статичним програмним інструкціям.

       """
word_change = 'яка'
words = []
gap = ' '
text_new = ''
splited = text.split()
for word in splited:
	if word == word_change:
		word = 'OLLA'
	words.append(word)
for item in words:
	text_new = text_new + item + gap
print(text_new)

